[{
        "title": "Face of Eternity",
        "author": "theasylm",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. Placez les chiffres 1 à 6 exactement une fois dans chaque ligne, colonne et case 2x3.\n\nSommes japonaises : les cases à l'extérieur de la grille indiquent l'ordre des séries de cellules contiguës qui doivent être colorées de la couleur de l'indice. Le nombre dans la case indique la somme des cellules de la série. Toutes les séries colorées sont indiquées. \n\nLes couleurs utilisées dans ce puzzle sont le vert, le rouge, le noir et le jaune.",
        "digits": "5623"
    },
    {
        "title": "Aperitif",
        "author": "Tallcat",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : Les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs et non répétitifs dans n'importe quel ordre.",
        "digits": "4513"
    },
    {
        "title": "Wheels",
        "author": "Alaric Taqi A. (Crusader175)",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n \nRoues : les chiffres dans un cercle gris doivent être placés dans le même ordre circulaire dans les quatre cellules touchées par le cercle. Les cercles peuvent devoir être tournés pour trouver la position correcte de 90°, 180° ou 270°. Les chiffres peuvent se répéter sur les roues comme le permettent normalement les autres règles.",
        "digits": "3462"
    },
    {
        "title": "Arrow Sudoku",
        "author": "Agent",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement d'autres règles.",
        "digits": "2153"
    },
    {
        "title": "Metamorphosnipe",
        "author": "Philip Newman",
        "rules": "Selectionnez exactement 6 chiffres de 1 à 9 et placez-les exactement une fois dans chaque ligne, colonne et boîte 2x3.\n\nFlèche multiplicative : le produit des chiffres le long d'une flèche est égal au nombre dans son cercle ou sa pilule connectée. Les chiffres dans les pilules forment des nombres à deux chiffres qui se lisent de gauche à droite ou de haut en bas. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "1432"
    },
    {
        "title": "Moon-Sun Caterdokupillar ",
        "author": "Math Pesto",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDessinez une boucle orthogonale sans branches et sans intersections qui visite chaque région exactement une fois. Dans chaque région, la boucle passe soit par toutes les lunes et aucun soleil, soit par tous les soleils et aucun lunes. La boucle ne peut pas passer par le même type d'indice dans deux régions utilisées consécutivement. La boucle agit comme une ligne German Whispers\n\nLigne German Whispers : les chiffres adjacents le long de ces lignes doivent avoir une différence d'au moins 3.",
        "digits": "5346"
    },
    {
        "title": "Double or Nothin'",
        "author": "Kennet's Dad",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes Garden Path : les lignes bleues sont divisées en segments par des bordures de boîte. Pour chaque ligne, la somme d'un segment sera le double de la somme de l'autre segment.",
        "digits": "4615"
    },
    {
        "title": "Caterdokupillar X-Cages",
        "author": "kuraban",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nBYO Killer : dessinez des cages Killer dans la grille de sorte que chaque cage contienne exactement une cellule avec indice et que les cages ne se chevauchent pas. La cellule avec indice doit se retrouver dans la cellule la plus à gauche de la rangée supérieure de la cage et le chiffre dans le cercle indique le nombre de cellules que contient la cage dans laquelle elle se trouve. Les chiffres dans les cages Kiler ne peuvent pas se répéter et leur somme doit correspondre à la valeur en haut à gauche de la cellule indiquée.",
        "digits": "1536"
    },
    {
        "title": "Signal Processing",
        "author": "FullDeck and Missing a Few Cards",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPalindromes : les chiffres sur une ligne grise se lisent de la même manière à l'endroit et à l'envers.\n\nQuadruples : les chiffres dans les cercles doivent tous apparaître au moins une fois dans le cellules qui les touchent.",
        "digits": "3156"
    },
    {
        "title": "Renban Sudoku",
        "author": "the_cogito",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : Les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nLes cercles en haut à gauche sont pour le prochain puzzle, ignorez-les pour l'instant.",
        "digits": "1425"
    },
    {
        "title": "Sandwich Sudoku",
        "author": "clover!",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes Sandwich : les chiffres entourés en dehors de cette grille 6x6 indiquent la somme des chiffres placés entre 1 et 6 dans cette ligne ou colonne. Cela inclut les chiffres entourés dans la grille précédente.",
        "digits": "5361"
    },
    {
        "title": "Cave Sudoku",
        "author": "Piatato",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCave : Ombrez certaines cellules pour former une grotte, de telle sorte que toutes les cellules non ombrées sont connectées orthogonalement entre elles et toutes les cellules ombrées sont connectées orthogonalement par d'autres cellules ombrées à un bord de la grille. Les cellules contenant une étoile ne doivent pas être ombrées, et un chiffre placé dans une telle cellule indique le nombre total de cellules vues dans les quatre directions orthogonales, y compris elle-même, où les cellules ombrées bloquent la vision.",
        "digits": "2415"
    },
    {
        "title": "The Sky's the Limit",
        "author": "JMoat13",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCercles de Comptage : un chiffre dans un cercle indique exactement combien de cercles contiennent ce chiffre.\nLes chiffres dans les cercles en dehors de la grille sont des indices de gratte-ciel.\n\nGratte-ciels : les chiffres dans la grille représentent des gratte-ciel, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts cachent tous les gratte-ciels plus petits derrière eux. Les indices en dehors de la grille indiquent le nombre de gratte-ciels visibles dans cette ligne/colonne, à partir de l'indice.",
        "digits": "4163"
    },
    {
        "title": "Every Cage a Unique Fibonacci",
        "author": "TwoHoleStraw",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages de Fibonacci : les chiffres dans les cages ne peuvent pas se répéter et leur somme est un nombre de Fibonacci (1, 2, 3, 5, 8, 13, 21). Chaque cage doit totaliser une valeur différente.",
        "digits": "6524"
    },
    {
        "title": "Sum or Product",
        "author": "James Sinclair",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages somme ou produit : les chiffres dans les cages ne peuvent pas se répéter et s'additionnent ou se multiplient pour donner la valeur en haut à gauche (ou éventuellement les deux).",
        "digits": "2463"
    },
    {
        "title": "Blueberry Crunch",
        "author": "Tyrgannus",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPoints premiers-composés : les chiffres séparés par l'une ou l'autre forme doivent totaliser 7 ou moins.\nLes chiffres séparés par un cercle totalisent un nombre premier.\nLes chiffres séparés par un carré totalisent un nombre non premier.",
        "digits": "1364"
    },
    {
        "title": "Grammar Nazi",
        "author": "Chameleon",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages de comptage Kropki : un chiffre à côté d'un point blanc en haut à gauche d'une cage indique exactement combien de points Kropki blancs peuvent être placés dans la cage, et un chiffre à côté d'un point noir en haut à gauche d'une cage indique exactement combien de points Kropki noirs peuvent être placés dans la cage, si cela est donné.\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2.\nDans ce puzzle, un 1 adjacent à un 2 compte à la fois comme un point noir et un point blanc.\nLes chiffres peuvent se répéter dans les cages comme le permettent normalement d'autres règles.\n\nPar exemple, un indice « 2⬤ 0◯ » indiquera qu'il y a exactement 2 points noirs et 0 point blanc dans la cage, et un indice « 1◯ » indiquera qu'il y a 1 point blanc et n'importe quelle quantité de points noirs.",
        "digits": "5126"
    },
    {
        "title": "Counting Spring Rolls",
        "author": "Gene",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCercles de comptages: un chiffre dans un cercle indique exactement combien de cercles contiennent ce chiffre.\nLes chiffres dans les cercles en dehors de la grille sont des indices de rouleaux de printemps.\n\nRouleaux de printemps : dans les quatre premières cellules de la grille à partir de l'indice, trouvez le chiffre le plus élevé et le plus bas. L'indice à l'extérieur de la grille indique la somme des chiffres qui sont placés entre ces deux cellules.",
        "digits": "1342"
    },
    {
        "title": "Hint of Providence",
        "author": "Mormagli ",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes entropiques : trois chiffres adjacents le long d'une ligne entropique pêche proviennent de chacun des chiffres bas (1,2), moyens (3,4) et élevés (5,6). \n\nLignes German Whispers : les chiffres adjacents le long de la ligne verte doivent avoir une différence d'au moins 3. Les lignes qui se croisent ne sont pas connectées et toutes les lignes sont droites.",
        "digits": "6524"
    },
    {
        "title": "Double-Booked",
        "author": "XeonRisq",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes distantes : un chiffre N dans une cage pointe vers l'un des chiffres X se trouvant à N cellules de distance verticalement ou horizontalement. Le nombre donné dans la cage est la somme de N+X.",
        "digits": "1632"
    },
    {
        "title": "Arrow Sudoku",
        "author": "Swaroop Guggilam",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "2543"
    },
    {
        "title": "Linesweeper Sudoku",
        "author": "Phistomefel",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLine Sweepers : dessinez une boucle dans la grille qui se déplace uniquement orthogonalement et ne se divise pas et ne se croise pas. Les sections de boucle peuvent se toucher orthogonalement et en diagonale.\nUn chiffre dans un cercle indique combien de cellules dans la zone 3x3 environnante centrée sur le cercle sont visitées, y compris la cellule entourée.",
        "digits": "6351"
    },
    {
        "title": "Narcisse",
        "author": "Christounet",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter et les valeurs de toutes les cellules de la cage s'additionnent au nombre en haut à gauche.\n\nChiffres en miroir : il y a 6 chiffres en miroir cachés dans la grille, exactement un dans chaque ligne, colonne et case. Chaque chiffre apparaît dans une cellule en miroir exactement une fois. Dans le cadre des cages tueuses, un chiffre X dans une cellule en miroir aura une valeur de 7-X. Par exemple, le chiffre 1 aurait une valeur de 6, et vice versa.",
        "digits": "2546"
    },
    {
        "title": "Region Sum Lines Sudoku",
        "author": "Florian Wortmann",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de somme des régions : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même.",
        "digits": "3152"
    },
    {
        "title": "Tapa Sudoku",
        "author": "DiMono",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nTapa : ombragez certaines cellules de sorte que toutes les cellules ombrées forment une zone connectée orthogonalement et qu'aucun zone de 2x2 ne soit entièrement ombré. \nLes cellules rouges ne peuvent pas être ombrées et contiennent un chiffre indiquant la longueur du groupe connecté de cellules ombrées dans ses 8 cellules environnantes.\nSi deux cellules adjacentes sont toutes les deux ombrées ou toutes les deux non ombrées, elles ne peuvent pas contenir de chiffres consécutifs.\n\nSommes ombrées : les indices en dehors de la grille indiquent la somme des chiffres dans les cellules ombrées de sa ligne ou de sa colonne.",
        "digits": "6524"
    },
    {
        "title": "Little Killer-X Sums-Kropki Pairs Sudoku ",
        "author": "Akash Doulani ",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLittle Killer : les nombres en dehors de la grille sont la somme des chiffres pointés le long de la diagonale indiquée. Les chiffres peuvent se répéter le long de ces diagonales comme le permettent normalement les autres règles.\n\nX-Sums : les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice.\n\nDuality : tous les indices sont à la fois Little Killer et X-Sums. \n\nKropki Dots : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.",
        "digits": "4312"
    },
    {
        "title": "Entropic Whisper Sudoku",
        "author": "thoughtbyte",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes entropiques : trois chiffres adjacents le long d'une ligne entropique pêche proviennent de chacun des chiffres faibles (1,2), moyens (3,4) et élevés (5,6). \n\nLignes de chuchotement allemandes : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.",
        "digits": "2456"
    },
    {
        "title": "Chain of Command",
        "author": "MathGuy_12",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nChaînes N : une chaîne N est un ensemble de N cellules dans une ligne ou une colonne qui s'indexent mutuellement dans un chemin pour former une boucle fermée. Une paire de cages colorées dans une ligne ou une colonne indique qu'il existe une chaîne N de la longueur donnée qui reste entre les cages et inclut les deux cages. Par exemple, 4 dans r1c1, 6 dans r1c4 et 1 r1c6 forment une chaîne N longue de 3 dans la ligne 1. Les cages bleues montrent les chaînes N en lignes et les cages rouges montrent les chaînes N en colonnes. Toutes les chaînes N ne sont pas nécessairement données.",
        "digits": "4631"
    },
    {
        "title": "Spinners",
        "author": "dorlir",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Si deux flèches sont attachées au même cercle, elles totalisent chacune indépendamment la valeur du cercle. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "2365"
    },
    {
        "title": "Nice Dice",
        "author": "Angelo",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nModèles de dés : les régions colorées de la grille sont des modèles de dés, ce qui signifie que s'ils étaient pliés en cube, vous auriez un exemplaire de chacun des chiffres 1 à 6 et chaque paire de côtés opposés totaliserait 7.",
        "digits": "5614"
    },
    {
        "title": "Waiting in the Wings",
        "author": "BremSter",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDiagonale extérieure : les chiffres orange à l'extérieur de la grille doivent être situés dans les trois premières cellules vues dans la direction indiquée par la flèche.",
        "digits": "4132"
    },
    {
        "title": "Thread Tap&Die SET",
        "author": "Clocksmith",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPalindromes : les chiffres sur une ligne grise se lisent de la même manière à l'avant et à l'arrière.",
        "digits": "2654"
    },
    {
        "title": "All things equal",
        "author": "Sktx",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nEquallines : les chiffres le long de chaque ligne dorée totalisent toujours le même nombre, qui doit être déterminé par le solveur.",
        "digits": "6231"
    },
    {
        "title": "Reflex",
        "author": "Jobo",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "5614"
    },
    {
        "title": "Equal Sums",
        "author": "Chris Napolitano",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes égales : les chiffres le long de chaque ligne dorée totalisent toujours le même nombre, qui doit être déterminé par le solveur.",
        "digits": "2165"
    },
    {
        "title": "Sum Caterpillar Trails",
        "author": "Rangsk",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de somme des régions : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non.",
        "digits": "6524"
    },
    {
        "title": "Positive Chess Thingy",
        "author": "Korshben",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter et s'additionner à la valeur en haut à gauche.\n\nChess Views : les cellules marquées « Bx » doivent voir exactement x cellules qui correspondent à leur valeur à un coup du Fou d'échecs. Les cellules marquées « Knx » doivent voir exactement x cellules qui correspondent à leur valeur à un coup du Cavalier d'échecs. Les cellules marquées « Kix » doivent voir exactement x cellules qui correspondent à leur valeur à un coup du Roi d'échecs.",
        "digits": "3412"
    },
    {
        "title": "My Phone Number",
        "author": "Lake",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLook-and-Say cages : le nombre en haut à gauche de la cage est divisé en paires. Chaque paire doit être lue comme « il y a des X Y dans la cage ». Donc pour ce puzzle, la cage contient un 5, trois 2, etc. Le « ? » peut représenter n'importe quel chiffre.",
        "digits": "6521"
    },
    {
        "title": "Directional Renban",
        "author": "Chad",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSerpents Renban : une cellule contenant une flèche est le début d'un serpent voyageant dans la direction indiquée. La longueur du serpent est égale au chiffre dans la cellule de la flèche (les serpents peuvent avoir une longueur d'une cellule). Un serpent est un chemin d'une cellule de large composé de cellules connectées orthogonalement qui ne se ramifie pas. Les serpents ne peuvent pas se chevaucher eux-mêmes ou chevaucher d'autres serpents.\nChaque serpent agit comme une ligne renban, avec des chiffres dessus formant un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.",
        "digits": "1453"
    },
    {
        "title": "Puzzle title",
        "author": "Logan Wall",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes entropiques : trois chiffres adjacents le long d'une ligne entropique proviennent de chacun des chiffres bas (1,2), moyens (3,4) et élevés (5,6). \n\nThermomètres sans bulbe : les chiffres doivent strictement augmenter à partir d'une extrémité de la ligne.\n\nAmbiguïté entropique-thermo-entropique : chaque ligne peut être soit un thermomètre sans bulbe, soit une ligne entropique. Le résolveur doit déduire quelles lignes sont des thermomètres sans bulbe et lesquelles sont des lignes entropiques.",
        "digits": "3126"
    },
    {
        "title": "Cat or Pillar",
        "author": "Michael Lefkowitz",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPiliers du chat : la somme des chiffres de chaque pilier est divisible par le chiffre du chat qui se tient au-dessus. Chaque chat a un chiffre différent.",
        "digits": "1452"
    },
    {
        "title": "Cater-pea-lar",
        "author": "SamuPiano",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de pois divisés : la somme des chiffres le long de chaque ligne reliant deux cercles (la somme n'inclut pas les cercles) est égale à un nombre à deux chiffres représenté par la concaténation des chiffres dans les cercles, dans n'importe quel ordre. Par exemple, si les cercles sont 1 et 3, alors la ligne qui les relie donne soit 13 soit 31 et un ensemble valide de chiffres le long de la ligne serait 346 car 3+4+6=13.\n",
        "digits": "4163"
    },
    {
        "title": "Nothing Loop",
        "author": "blackjackfitz",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement indiqués.\n\nRégion supplémentaire : dans les cellules contenant des cercles, chaque chiffre doit apparaître exactement une fois. \n\nBoucle de rien : dessinez une boucle d'une largeur d'une cellule qui se déplace orthogonalement entre les centres de certaines cellules. La boucle peut se toucher orthogonalement et en diagonale. \n\nLes bordures de la boîte divisent la boucle en segments.\n\nUn chiffre dans un cercle se trouve sur la boucle et donne la longueur de son segment.\n\nUn chiffre dans un carré indique le nombre de cellules non-boucle dans les (jusqu'à 9) cellules environnantes, y compris lui-même. \n",
        "digits": "3254"
    },
    {
        "title": "Hangry",
        "author": "Nebuzaradan",
        "rules": "Sélectionnez exactement 6 chiffres de 1 à 9 et placez-les exactement une fois dans chaque ligne, colonne et boîte 2x3.\n\nX-Sums : Les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice.\n'a' représente le même nombre dans l'ensemble du puzzle, avec '2a' étant le double de ce nombre.\n\nPour les 4 chiffres donnés à la grille suivante, traitez tous les chiffres supérieurs à 6 comme les chiffres manquants dans la plage de 1 à 6 dans l'ordre numérique. Par exemple, si les six chiffres utilisés dans le puzzle sont 135679, le 7 sera traité comme un 2, puis le 9 sera traité comme un 4 dans la grille suivante. \n\nPour la vérification des réponses, cette grille ne doit contenir que des chiffres compris entre 1 et 6, comme expliqué ci-dessus.",
        "digits": "3546"
    },
    {
        "title": "Counting Lines",
        "author": "Nurator",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nCompter les lignes : un chiffre sur une ligne indique exactement combien de cellules sur cette ligne contiennent ce chiffre. \n",
        "digits": "2461"
    },
    {
        "title": "Lines of Descent",
        "author": "BenceJoful",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches de descente : pour chaque cellule contenant une flèche, déplacez-vous N fois dans la direction de la flèche pour arriver à une cellule avec la valeur N-1, où N est la valeur du chiffre dans la cellule avec la flèche.",
        "digits": "5316"
    },
    {
        "title": "I'm so hungry, I could eat...",
        "author": "Pallando",
        "rules": "Règles normales du Sudoku 6x6.\n\nBalayeur de parité : un chiffre dans un cercle indique combien de cellules dans la zone 3x3 environnante centrée sur le cercle ont la même parité que le chiffre entouré, y compris le chiffre dans le cercle lui-même. \n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous ces points ne sont pas nécessairement donnés.\n\nPoints Kropki diagonaux : les chiffres séparés en diagonale par un point noir dans un coin ont un rapport de 1:2. Par exemple, si la ligne 2 de la colonne 3 était un 4, alors la ligne 3 de la colonne 4 serait un 2. Tous ces points ne sont pas nécessairement indiqués.",
        "digits": "6425"
    },
    {
        "title": "Arrow Sum Pointers",
        "author": "Mr.Menace",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches de pointage : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. De plus, le chiffre dans le cercle doit apparaître au moins une fois dans la direction pointée par sa flèche, sans inclure la pointe de la flèche comme option valide.",
        "digits": "4312"
    },
    {
        "title": "Mystery Square Cages",
        "author": "ICHTUES",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages carrées mystérieuses : la somme des chiffres de chaque cage donne un nombre carré (un nombre qui est le résultat de la multiplication d'un nombre entier par lui-même), mais aucune cage ne donne le même nombre carré. Les chiffres d'une cage PEUVENT se répéter si d'autres règles le permettent.",
        "digits": "4312"
    },
    {
        "title": "Twelve Spots",
        "author": "Marty Sears",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nBYO Lines : dessinez 6 lignes, chacune avec un point turquoise différent à chaque extrémité. Les lignes doivent visiter au moins 3 cellules, y compris leurs cellules de départ et de fin. Les lignes peuvent se déplacer orthogonalement ou en diagonale. Les lignes ne peuvent pas se ramifier, se croiser, partager des cellules ou passer directement par des panneaux « Sens interdit ».\n\nLignes de même différence : chaque ligne est une ligne de « même différence ». Chaque paire de cellules adjacentes le long d'une ligne a la même différence ; il s'agit de sa « valeur de différence ». Chaque ligne a une « valeur de différence » différente.",
        "digits": "2146"
    },
    {
        "title": "tortie",
        "author": "jneen",
        "rules": "Les règles normales du sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter.\n\nPoints non consécutifs : les chiffres dans les cellules séparés par des points rouges doivent être non consécutifs.\n\nPoints de différence : les chiffres séparés par un point blanc avec 2 indiquent que les cellules ont une différence de 2.",
        "digits": "2416"
    },
    {
        "title": "Squirmeeeeeee",
        "author": "glum_hippo",
        "rules": "Les règles normales du sudoku 6x6 s'appliquent.\n\nLignes hautes et basses : le long des lignes vert foncé, les chiffres adjacents doivent alterner entre les chiffres hauts (4-6) et bas (1-3).\n\nGratte-ciels : les chiffres de la grille représentent les gratte-ciels, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts obscurcissent tous les gratte-ciels plus petits derrière eux. Les 3 au-dessus de la colonne 3 ainsi que les chiffres le long des lignes à l'extérieur de la grille indiquent le nombre de gratte-ciels vus dans cette ligne/colonne, à partir de la ligne de vue de l'indice. Ces chiffres à l'extérieur de la grille sont toujours limités aux valeurs comprises entre 1 et 6.",
        "digits": "5361"
    },
    {
        "title": "Curled Up",
        "author": "RSP",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de séquence enveloppantes : les lignes grises de la grille sont des lignes de séquence. Le long de chaque ligne de séquence se trouve une séquence de chiffres dans l'ordre avec une différence constante, telle que 1234 ou 642. Cette différence constante peut être négative mais ne change pas de signe, donc 242 n'est pas une ligne de séquence valide. La différence constante peut être de 0, donc 444 est une ligne de séquence valide. Chaque ligne peut avoir une différence constante unique. \n\nCependant, les chiffres sont comptés sous le mod 6, ce qui signifie qu'un 7 dans la séquence est remplacé par un 1 à la place, et un 8 par un 2 et ainsi de suite, cela s'enroule. Cela rend la séquence 4-5-6-1-2 possible, par exemple.",
        "digits": "1234"
    },
    {
        "title": "Battlefield sudoku",
        "author": "Ambrose",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nBattlefield : Considérez les X premières et les Y dernières cellules d'une ligne ou d'une colonne, où X est la valeur de la première et Y la valeur de la dernière cellule. Les indices en dehors de la grille donnent la somme des chiffres où ces groupes se chevauchent, ou la somme des chiffres strictement entre ces groupes lorsqu'ils ne se chevauchent pas.",
        "digits": "4625"
    },
    {
        "title": "Green and Bear It",
        "author": "Lumos",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotement allemand : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.",
        "digits": "6312"
    },
    {
        "title": "Arrow Sudoku",
        "author": "Mitchell Lee",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "4251"
    },
    {
        "title": "Elephant",
        "author": "Xenonetix",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de somme des régions : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des valeurs de chaque segment est la même.\n\nYin Yang : ombragez certaines cellules de telle sorte que toutes les cellules ombrées appartiennent à une seule zone orthogonale connectée et que toutes les cellules non ombrées appartiennent également à une seule zone orthogonale connectée. De plus, aucune zone 2x2 n'est entièrement ombrée ou non ombrée. Les cellules non ombrées sont doublées pour les besoins de la ligne de somme des régions.",
        "digits": "5142"
    },
    {
        "title": "Instructions from the Outside",
        "author": "Strosahl",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nIndices descriptifs : les mots situés à l'extérieur de la grille indiquent que les chiffres des deux cellules les plus proches de la ligne/colonne indiquée appartiennent aux ensembles de chiffres suivants. Grand (456), Petit (123), Pair (246), Impair (135) et Premier (235).",
        "digits": "6123"
    },
    {
        "title": "Outside the Box",
        "author": "angel shaaark",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nX-Sums (?): Tout nombre placé en dehors de la grille indique la somme des premières valeurs X vues, où X est la première valeur vue. Ces nombres peuvent être vus soit vers la gauche, soit vers le bas.\n\nRemarque : le document d'aide qui l'accompagne contient des conseils si vous en avez besoin.",
        "digits": "3415"
    },
    {
        "title": "Lepidoptera",
        "author": "ThePedallingPianist",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches de rang complet : si les six nombres formés en lisant les 2 chiffres d'une flèche dans le sens de la flèche étaient classés par ordre de taille, le chiffre dans le cercle de la flèche représente son rang dans la liste du plus bas (1) au plus haut (6). Il n'y a pas de rangs ex aequo. Autrement dit, les chiffres entourés ne contiennent aucune répétition et les nombres à 2 chiffres ne contiennent aucune répétition.",
        "digits": "4263"
    },
    {
        "title": "Whirlpool",
        "author": "Darth Paradox",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches moyennes : un chiffre dans un cercle est égal à la moyenne des chiffres sur la flèche attachée. Chaque cercle a exactement une flèche attachée ; l'autre flèche qui coupe chaque cercle le traverse directement sans tourner et les flèches ont été colorées/différentes en épaisseur pour plus de clarté sur ce front. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "5431"
    },
    {
        "title": "Nameless sudoku",
        "author": "Dexter Bartholemeow",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nRoller Coaster : dessinez une boucle non sécante qui se déplace orthogonalement entre les centres de certaines cellules de la grille. Les indices à gauche des lignes indiquent la somme des chiffres sur les segments horizontaux de la boucle dans cette ligne, dans le bon ordre. Les indices au-dessus des colonnes indiquent la somme des chiffres sur les segments verticaux de la boucle dans cette colonne, dans le bon ordre. Un '?' peut remplacer n'importe quelle valeur de 0 à 9, mais aucun indice ne peut avoir de zéro initial.",
        "digits": "4623"
    },
    {
        "title": "Simple as abcde15",
        "author": "Memeristor",
        "rules": "Les règles normales du sudoku 6x6 s'appliquent.\n\nSalles numérotées : les indices en dehors de la grille indiquent le chiffre qui doit être placé dans la N-ième cellule dans la direction correspondante, où N est le chiffre placé dans la première cellule dans cette direction.\n\nCrypté : chaque instance de la même lettre fait référence au même chiffre et chaque lettre différente correspond à un chiffre différent.",
        "digits": "1326"
    },
    {
        "title": "random puzzle goes brrr",
        "author": "playmaker6174",
        "rules": "Les règles normales du sudoku 6x6 s'appliquent.\n\nCages meurtrières : les chiffres dans les cages ne peuvent pas se répéter et s'additionner à la valeur du haut gauche.",
        "digits": "6251"
    },
    {
        "title": "Arctic Moth",
        "author": "Kinnison",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nThermomètres lents : les chiffres ne doivent pas diminuer le long du thermomètre à partir de l'extrémité du bulbe. ",
        "digits": "2413"
    },
    {
        "title": "ルックエア に して くれ (Make it Look-Air)",
        "author": "AkashG23",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotement allemandes : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.\n\nRegard en l'air : ombragez certaines cellules de telle sorte que toutes les régions connectées de cellules ombrées forment des carrés. Deux carrés de la même taille peuvent ne pas avoir de vue directe l'un sur l'autre (c'est-à-dire avoir une ligne droite de cellules non ombrées entre eux) mais peuvent être dans la même ligne ou colonne s'ils sont obstrués par d'autres cellules ombrées. \nLe chiffre dans un hexagone représente le nombre de cellules ombrées dans la forme plus qui est créée par la cellule elle-même et ses 4 voisins orthogonaux. ",
        "digits": "5632"
    },
    {
        "title": "Not My Vault",
        "author": "kinoseidon",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nVaults : les chiffres dans une cage ne peuvent apparaître dans aucune cellule orthogonalement adjacente à la cage. Les chiffres PEUVENT se répéter dans une cage.\n\nRegardez et dites : les chiffres xy en haut à gauche d'une cage comptent le chiffre y apparaissant x fois. L'indice fait référence soit aux chiffres dans la cage, soit aux chiffres orthogonalement adjacents à la cage.\nPar exemple, un indice de « 24 » signifie qu'il y a exactement deux 4 dans la cage, ou exactement deux 4 orthogonalement adjacents à la cage. ",
        "digits": "6341"
    },
    {
        "title": "Weird, Bad, Spots",
        "author": "rockratzero",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.\n\nLittle Killer : les nombres en dehors de la grille sont la somme des chiffres pointés le long de la diagonale indiquée, DANS ce 6x6. Les chiffres peuvent se répéter le long de ces diagonales comme le permettent normalement les autres règles.\nLes valeurs des indices respectent les règles des points Kropki et doivent être déduites par le solveur.",
        "digits": "3512"
    },
    {
        "title": "Irrswich PLAS",
        "author": "The Book Wyrm",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPsycho Look-and-Say Killers : Chaque chiffre dans une cage rose indexe une cellule de la grille. La cellule est située dans la case contenant le numéro du chiffre, à la même position dans la case que la cellule contenant le chiffre (en comptant les cases de gauche à droite et de haut en bas). Un chiffre peut indexer sa propre cellule. L'indice de la cage doit être lu comme un indice de type « regardez et dites » qui compte le nombre de fois qu'un chiffre apparaît dans toutes les cellules indexées.\n\nIrrwisch : chaque fois que la lettre A apparaît, elle représente une valeur différente de 1 à 6.",
        "digits": "2461"
    },
    {
        "title": "Nurikabe Hybrid",
        "author": "MaizeGator",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nNurikabe : Ombrez certaines cellules en bleu, représentant l'eau, de telle sorte que toute l'eau soit connectée orthogonalement, mais qu'aucune zone 2x2 ne soit entièrement couverte. Ombrez toutes les autres cellules en vert, formant des groupes de cellules connectées orthogonalement appelées îles.\n\nChaque île contient exactement un indice de cage, et le chiffre dans la cage indique la taille de son île. Le nombre en haut à gauche d'une cage donne la somme de toutes les cellules de l'île. Le solveur doit déduire la forme des îles. Les chiffres ne peuvent pas se répéter dans les îles.",
        "digits": "2635"
    },
    {
        "title": "Caterkiller",
        "author": "Malrog",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes tueuses : le long de la ligne, les chiffres sont regroupés en sections, chacune contenant exactement un petit indice de chiffre. Les chiffres d'une section ne peuvent pas se répéter et doivent totaliser la valeur de l'indice.",
        "digits": "3524"
    },
    {
        "title": "7 Dots",
        "author": "I Love Sleeping",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de parité : les chiffres le long d'une ligne de parité rouge alternent entre pairs et impairs.\n\n7 points : un chiffre N dans une cellule avec un point donne 7 avec un ou plusieurs chiffres dans la direction du point, en commençant par le Nième chiffre dans cette direction. ",
        "digits": "6154"
    },
    {
        "title": "Raupe Nimmersatt",
        "author": "Palfly Kampling",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes distantes : un chiffre N dans une cage pointe vers l'un des chiffres Y, c'est-à-dire à N cellules de distance verticalement ou horizontalement. Le nombre donné dans la cage est la somme de N+Y.\nDans ce puzzle, les sommes distantes peuvent pointer exactement une cellule en dehors de la grille, faisant de cette cellule un indice X-Sums.\n\nX-Sums : les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice.",
        "digits": "1325"
    },
    {
        "title": "Double Arrow Sudoku",
        "author": "Jakhob and wooferzfg",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDouble Arrows : la somme des chiffres dans deux cercles est égale à la somme des chiffres sur la ligne les reliant. Les chiffres peuvent se répéter dans les cercles et sur les lignes comme le permettent normalement les autres règles.",
        "digits": "5164"
    },
    {
        "title": "Kropkiller Sudoku",
        "author": "Barbitos",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages Kropki : la valeur d'une cage est la somme des chiffres qu'elle contient.\nLes valeurs des cages séparées par un point blanc sont consécutives. \nLes valeurs des cages séparées par un point noir ont un rapport de 1:2.\nTous les points possibles entre les cages sont indiqués.",
        "digits": "2543"
    },
    {
        "title": "Staircase",
        "author": "isamook",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nQuadruples : les chiffres dans les cercles doivent tous apparaître au moins une fois dans les cellules qui les touchent.",
        "digits": "3261"
    },
    {
        "title": "Slitherlink Sudoku",
        "author": "Gliperal",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSlitherlink : dessinez une boucle fermée le long des bords de la grille qui ne se ramifie pas et ne se touche pas. Les cellules contenant les chiffres 1 à 3 indiquent le nombre de bords de la cellule qui sont utilisés par la boucle. Un 4 indique qu'aucun des bords de la cellule n'est utilisé par la boucle, et 5 et 6 sont ignorés pour les besoins de Slitherlink.\nCependant, s'il y a un indice en haut à gauche de la cellule, le chiffre à l'intérieur de la cellule est ignoré et l'indice en haut à gauche est utilisé à la place. Un ? peut représenter n'importe quel indice de 0 à 3.",
        "digits": "6215"
    },
    {
        "title": "Finders Sweepers",
        "author": "fjam",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de parité : les chiffres le long d'une ligne de parité alternent entre pairs et impairs.\n\nLignes les plus longues Sweepers : Le chiffre dans un cercle indique la longueur de la plus longue ligne de parité orthogonale connectée qui peut être tracée dans les 8 cellules environnantes (dans cette grille 6x6). La longueur d'une ligne est le nombre de segments de ligne nécessaires pour la tracer. Par conséquent, une ligne entrant dans N cellules autour d'un cercle a une longueur N-1. Par exemple, une ligne reliant trois cellules, dessinée avec deux segments de ligne, a une longueur de 2.",
        "digits": "1462"
    },
    {
        "title": "Region Sum lines Consecutive Pairs",
        "author": "Ashish Kumar",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nRegion Sum Lines: Les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non.\n\nKropki Dots: Les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement donnés.",
        "digits": "1326"
    },
    {
        "title": "A single between line",
        "author": "superrabbit",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nEntre les lignes : les chiffres sur une ligne intermédiaire doivent être strictement entre les chiffres remplis dans les cercles, à l'exclusion des chiffres dans les cercles.",
        "digits": "3465"
    },
    {
        "title": "Caterpiller Split Sum Loop",
        "author": "Virtual",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nBoucle de sommes distantes : tracez une boucle à travers la grille qui visite chaque cage et ne se touche pas orthogonalement, mais peut se toucher en diagonale. Un chiffre N dans une cage pointe vers l'un des chiffres X, c'est-à-dire à N cellules de distance le long de la boucle dans les deux sens. Le nombre donné dans la cage est la somme de N+X.",
        "digits": "5621"
    },
    {
        "title": "Hexed",
        "author": "No-Feet McGee",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotement allemand à 5 différences : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 5.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nLignes de somme de région : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non.\n\nPalindromes : les chiffres sur une ligne grise se lisent de la même manière à l'avant et à l'arrière. ",
        "digits": "6534"
    },
    {
        "title": "Junction Depot",
        "author": "Riffclown",
        "rules": "Les règles irrégulières du Sudoku 6x6 s'appliquent. Placez les chiffres 1 à 6 exactement une fois dans chaque ligne, colonne et zone en gras.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "2641"
    },
    {
        "title": "For Memeristor's Insect Puzzle",
        "author": "WISTY 'WORD SEACH' FALL",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDouble indexeurs : le chiffre dans une cellule ombrée indique à la fois la colonne dans laquelle le numéro de colonne de la cellule apparaît dans sa ligne et la ligne dans laquelle son numéro de ligne apparaît dans sa colonne. (c'est-à-dire que si r4c6 était un 3, il y aurait un 6 dans r4c3 et un 4 dans r3c6.)",
        "digits": "6215"
    },
    {
        "title": "Detour",
        "author": "grkles",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLittle Killer : les nombres en dehors de la grille sont la somme des chiffres pointés le long de la diagonale indiquée, DANS cette grille 6x6. Les chiffres peuvent se répéter le long de ces diagonales comme le permettent normalement les autres règles. ",
        "digits": "4526"
    },
    {
        "title": "Quadlibet",
        "author": "Raumplaner",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes quadruples : un cercle à un coin signifie que l'un des quatre chiffres environnants est la somme des trois chiffres restants du coin. Tous les points ne sont pas nécessairement indiqués.\n\nAvertissement : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement indiqués.",
        "digits": "5631"
    },
    {
        "title": "Shyscrapers",
        "author": "Lisztes",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nGratte-ciels internes : les chiffres de la grille représentent les gratte-ciels, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts obscurcissent tous les gratte-ciels plus petits derrière eux. Les indices indiquent le nombre de gratte-ciels qui peuvent être vus dans cette ligne/colonne, à partir de la ligne de vue de l'indice.\n\nCEPENDANT : les indices sont à l'intérieur de la grille, dans les cages sous forme de nombres à un chiffre par paires. Les cages horizontales contiennent les indices de la ligne donnée (le chiffre de gauche est l'indice extérieur du côté gauche, le chiffre de droite est l'indice extérieur du côté droit), les cages verticales contiennent les indices de la colonne donnée (le chiffre du haut est l'indice du dessus du puzzle, le chiffre du bas est l'indice du dessous du puzzle).",
        "digits": "1243"
    },
    {
        "title": "numbered clues",
        "author": "Andrewsarchus",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes XV : les chiffres séparés par un V doivent totaliser 5, et les chiffres séparés par un X doivent totaliser 10. Tous les X et V ne sont pas nécessairement donnés.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les Chiffres séparés par un point noir ont un rapport 1:2. Tous les points ne sont pas nécessairement donnés.\n\nPair/Impair : les cellules contenant un carré gris sont paires. Les cellules contenant un cercle gris sont impaires.\n\nIndices numérotés : un point X, V ou Kropki à l'extérieur de la grille est placé sur le bord des Nième et (N+1)ième cellules de l'indice, où N est le chiffre le plus proche de l'indice.\n\nUn indice pair/impair à l'extérieur de la grille est placé dans la Nième cellule de l'indice où N est le chiffre le plus proche de l'indice.",
        "digits": "3456"
    },
    {
        "title": "X-Sums Killer Sudoku",
        "author": "KNT",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages X-Sum : dans les cages, les chiffres ne peuvent pas se répéter, y compris les chiffres individuels placés à l'extérieur de la grille dans les cages. Par exemple, si vous avez placé un 12 dans un indice extérieur, vous ne pouvez pas répéter le 1 ou le 2 dans la cage. Les chiffres placés à l'extérieur de la grille dans les cages deviennent un indice X-Sum. Cela signifie que les chiffres à l'extérieur de la grille doivent être égaux à la somme des X premiers chiffres, vus dans la direction de l'indice, où X est le premier chiffre de cette ligne ou colonne. ",
        "digits": "1362"
    },
    {
        "title": "Renban Sudoku",
        "author": "Sam Cappleman-Lynes",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les lignes violettes dans la grille sont des lignes Renban. Les chiffres sur une ligne forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.",
        "digits": "5426"
    },
    {
        "title": "Give Me All",
        "author": "Toir",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPalindrome : les chiffres le long de la ligne grise se lisent de la même manière à l'avant et à l'arrière.\n\nLignes d'impression : il y a des lignes violettes avec des cercles et des flèches qui leur sont attachés dans la grille. Le chiffre entouré indique combien de fois les chiffres le long de la ligne (y compris les cercles et les flèches) apparaissent dans les cellules pointées par la flèche.\n\nPar exemple, une ligne 15(3)2 est valide si les chiffres qu'elle pointe sont 2 ; 3 ; 6 ; 3, car le 3 apparaît deux fois, le 2 apparaît une fois et aucun autre chiffre de la ligne n'apparaît, ce qui fait 3 fois ce qui est le chiffre dans le cercle.",
        "digits": "4563"
    },
    {
        "title": "Black Sheep",
        "author": "Blobz",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKropki Dots: Les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.",
        "digits": "3642"
    },
    {
        "title": "Drawers",
        "author": "Stephane Bura",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDrawers: Si une cellule contient une flèche, elle est appelée origine. La cellule dans la direction de la flèche à une distance égale à la valeur de l'origine est appelée sa destination. Ainsi, un tiroir avec un 3 dans l'origine occupera exactement 3 cellules, y compris l'origine et la destination.\n\nPour une ligne donnée (rangée ou colonne) et une direction perpendiculaire donnée à cette ligne pour les flèches, les destinations sont un nouvel arrangement des origines. Cela signifie qu'il s'agit des mêmes chiffres, dans un ordre différent.\n\nVous pouvez considérer les flèches comme des poignées de tiroir, pour des tiroirs de longueur égale aux valeurs des origines. Vous tirez les tiroirs jusqu'à ce que les destinations prennent la place des origines.",
        "digits": "6234"
    },
    {
        "title": "Norin",
        "author": "thetearex15",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nMarques de crayon données : Certaines marques de crayon ont été données. Ceux-ci représentent toutes les valeurs possibles de cette cellule.",
        "digits": "4125"
    },
    {
        "title": "Even/odd and xv",
        "author": "Casey",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes XV : les chiffres séparés par un V doivent totaliser 5, et les chiffres séparés par un X doivent totaliser 10. \n\nPair/impair : les cellules contenant un carré gris sont paires. Les cellules contenant un cercle gris sont impaires.",
        "digits": "6413"
    },
    {
        "title": "Mini Escalator",
        "author": "Artifex_Amanda",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nThermomètres : les chiffres doivent augmenter strictement le long du thermomètre en commençant par l'extrémité du bulbe.",
        "digits": "5241"
    },
    {
        "title": "Skyscrapers",
        "author": "Bill Murphy",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nGratte-ciels : les chiffres de la grille représentent les gratte-ciels, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts occultent tous les gratte-ciels plus petits derrière eux. Les indices en dehors de la grille indiquent le nombre de gratte-ciels qui peuvent être vus dans cette ligne/colonne, à partir de la ligne de vue de l'indice.",
        "digits": "3416"
    },
    {
        "title": "Consecutive Purpl Caterpillars",
        "author": "Cane_Puzzles",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les lignes violettes dans la grille sont des lignes Renban. Les chiffres sur une ligne forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.",
        "digits": "5463"
    },
    {
        "title": "Cut Across",
        "author": "Antiknight",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : il y a des cercles dans la grille avec des flèches attachées. Le chiffre dans le cercle est égal à la somme des chiffres sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement d'autres règles.\n\nFlèches supérieures à : il y a également des flèches rouges dans la grille. Les chiffres dans les cellules avec une flèche rouge sont plus grands que tous les autres chiffres dans les cellules le long de la direction de la flèche.",
        "digits": "3652"
    },
    {
        "title": "Six Times Tables",
        "author": "Paws🐾",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nMuliplication Calcudoku : les chiffres dans les cages doivent se multiplier jusqu'aux totaux donnés. Les chiffres PEUVENT se répéter si d'autres règles le permettent normalement.",
        "digits": "4352"
    },
    {
        "title": "Geradeweg Sudoku",
        "author": "Wessel Strijkstra/It's Stark Jr.!",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nEn boucle : à l'aide de lignes orthogonales, tracez une boucle non sécante passant par les centres de certaines cellules et passant par chaque cellule indiquée. Les chiffres de chaque segment de ligne droite qui touche un indice doivent avoir une somme égale à la valeur de l'indice. Dans le cas d'un ?, la valeur de cet indice doit être déterminée.",
        "digits": "3621"
    },
    {
        "title": "N-Whispers",
        "author": "mr.mango (ndsurgenor)",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nN-Whispers : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins N, où N est le nombre de cellules traversées par la ligne.",
        "digits": "6452"
    },
    {
        "title": "Lightbulb",
        "author": "Doziam",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nEntre les lignes : les chiffres sur une ligne intermédiaire doivent être strictement entre les chiffres remplis dans les cercles, à l'exclusion des chiffres dans les cercles.",
        "digits": "3621"
    },
    {
        "title": "Renban Arrow Sudoku",
        "author": "Timberlake",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "4352"
    },
    {
        "title": "1812 Overture",
        "author": "starwarigami",
        "rules": "Placez les chiffres 0 à 6 exactement une fois dans chaque ligne, colonne et case.\nPour y parvenir, chaque ligne, colonne et case contient une « cellule Schrödinger » contenant 2 chiffres.\nLes cellules ombrées qui sont partagées avec d'autres grilles ne doivent pas être des cellules S ou contenir 0.\n\nCages meurtrières : les chiffres dans les cages ne peuvent pas se répéter et leur somme ne peut être que 12 ou 18.",
        "digits": "3524"
    },
    {
        "title": "Pencilmark Sudoku",
        "author": "jojo81",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDonnées : certaines des marques de crayon ont été données. Elles représentent toutes les valeurs possibles de cette cellule.",
        "digits": "2465"
    },
    {
        "title": "Green Stripes",
        "author": "Emphyrio",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de décalage : les lignes turquoise de la grille sont des lignes de décalage. Chaque cellule le long d'une moitié de la ligne est associée à la cellule à la même distance du centre de l'autre côté de la ligne. Sur une moitié de la ligne, chaque chiffre est exactement un de plus que le chiffre de la cellule appariée sur l'autre moitié de la ligne. \nPar exemple, une ligne de décalage de 4 cellules pourrait avoir les chiffres 1-3-4-2 ou 5-3-2-4, mais pas 5-3-2-6 (3 est un de plus que 2 mais 5 n'est pas un de plus que 6).",
        "digits": "2315"
    },
    {
        "title": "Optimize",
        "author": "DadJokes",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDoubles flèches : la somme des chiffres dans deux cercles est égale à la somme des chiffres sur la ligne qui les relie. Les chiffres peuvent se répéter dans les cercles et sur les lignes comme le permettent normalement les autres règles.",
        "digits": "6234"
    },
    {
        "title": "International Travel",
        "author": "99%Sneaky",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCercles de somme de bordure : divisez les chiffres autour d'un cercle blanc en 2 groupes de 2 le long d'une bordure épaisse. Ces deux groupes doivent avoir la même somme l'un que l'autre, et chacun des cercles doit avoir une somme différente de celle des autres cercles. Sur le cercle à l'intersection de 4 cases, les paires verticales et horizontales doivent être satisfaites.\n\nCercles de somme anti-frontière : divisez les chiffres autour d'un cercle gris en 2 groupes de 2 le long d'une bordure épaisse. Ces deux groupes doivent avoir une somme différente l'un de l'autre. Les paires horizontales et verticales doivent être satisfaites.",
        "digits": "4156"
    },
    {
        "title": "Sequence Lines Sudoku",
        "author": "Awesomesauce",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de séquence : le long d'une ligne, toutes les paires de chiffres adjacents doivent avoir la même différence dans la même direction, que ce soit strictement croissant, décroissant ou restant le même.",
        "digits": "3412"
    },
    {
        "title": "Butterfly Hunt",
        "author": "Qodec",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nChasse au trésor : un chiffre dans une cellule rose vous indique combien des 8 cellules environnantes contiennent des chiffres supérieurs au chiffre de la cellule rose elle-même. Toutes les cellules roses ne sont pas nécessairement données.",
        "digits": "6521"
    },
    {
        "title": "Incomparable",
        "author": "filuta",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDeux ordres : à chaque chiffre est attribué une lettre distincte de A à F. Cela donne aux chiffres deux ordres possibles : numérique et alphabétique. Vous pouvez noter quelle lettre correspond à quel chiffre dans les cellules situées sous la grille.\n\nThermomètres : les valeurs doivent augmenter strictement le long du thermomètre à partir de l'extrémité du bulbe, numériquement ou alphabétiquement.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de valeurs consécutives non répétitives (numériquement ou alphabétiquement) dans n'importe quel ordre.",
        "digits": "5146"
    },
    {
        "title": "German Whispers Palindrome Sudoku",
        "author": "Lizzy01",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes German Whispers : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.\n\nPalindromes : les chiffres sur une ligne grise se lisent de la même manière à l'avant et à l'arrière.",
        "digits": "2653"
    },
    {
        "title": "Jail",
        "author": "Memeristor's Fiancée",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter et s'additionner à la valeur en haut à gauche.",
        "digits": "2136"
    },
    {
        "title": "Doing Rounds",
        "author": "Clarke",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nArrow Loop : dessinez une boucle que Clarke doit parcourir dans le sens inverse des aiguilles d'une montre, qui commence et se termine à son endroit préféré, indiqué par le chat. La boucle de Clarke doit visiter toute la menthe et la laitue.\nAu fur et à mesure qu'il avance, Clarke renifle son environnement, de sorte que sa boucle ne se croise pas ou ne se touche pas orthogonalement, mais sa boucle peut occasionnellement se toucher en diagonale.\nLorsque Clarke entre pour la première fois dans une ligne ou une colonne contenant de la laitue, il doit se rendre directement dans la cellule contenant de la laitue et nom nom dessus. La seule laitue de la grille se trouve dans la rangée 2 de la colonne 3.\nLorsqu'il quitte une cellule de menthe, Clarke roule sur le dos et doit donc se déplacer le long d'une diagonale dans n'importe quelle direction. Dans tous les autres cas, sa boucle se déplace de manière orthogonale.\n\nLe chemin de Clarke est entièrement constitué de flèches, commençant par le cercle d'une flèche, puis le(s) chiffre(s) le long de la flèche (en suivant le chemin dans le sens inverse des aiguilles d'une montre comme spécifié ci-dessus). Lorsqu'une flèche se termine, la cellule suivante du chemin devient le cercle de la flèche suivante. Tous les cercles de flèches sont constitués d'une seule cellule. Son endroit préféré est le cercle de la première flèche et n'est pas du tout inclus dans la dernière flèche. \n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "6514"
    },
    {
        "title": "String is the best part",
        "author": "Benny",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nJouets à ficelles : ce sont les jouets à ficelles de Benny ! Pour tous les jouets, le chiffre dans la cellule du jouet est le nombre de chiffres le long de la chaîne attachée qui sont supérieurs au chiffre dans la cellule du jouet.",
        "digits": "4352"
    },
    {
        "title": "White Space",
        "author": "Fuxia",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes fléchées : un chiffre dans une cellule avec des flèches est la somme de toutes les cellules adjacentes dans la direction des flèches. Par exemple, si R2C5 est un 5, alors R3C4 pourrait être un 2 et R3C6 un 3.\n\nLe D en bas à gauche est pour le prochain puzzle, veuillez l'ignorer pour l'instant.",
        "digits": "3516"
    },
    {
        "title": "Double Ambiguity",
        "author": "Sayori",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDoubleurs : il y a six doubleurs, un dans chaque ligne, colonne et case. Pour les besoins des indices, les doubleurs doublent la valeur d'une cellule. Chaque chiffre de 1 à 6 est doublé exactement une fois. L'un de ces doubleurs est donné par le D dans la case 2. Ces doubleurs s'appliquent uniquement à cette grille.\n\nThermomètres : les chiffres doivent strictement augmenter le long du thermomètre à partir de l'extrémité du bulbe.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. Si deux flèches sont attachées au même cercle, elles totalisent chacune indépendamment la valeur du cercle. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.\n\nThermo-Flèche-Ambiguité : les lignes grises avec une ampoule sont soit des flèches, soit des thermomètres. Les solveurs doivent déterminer le type de ligne pour chaque ligne. Plusieurs lignes sortant de la même ampoule peuvent être de types différents.",
        "digits": "2461"
    },
    {
        "title": "Parity Party Sudoku",
        "author": "Édouard Lebeau aka SudoKanard",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nParity Party : les nombres en dehors de la grille indiquent la somme jusqu'au premier chiffre pair inclus ou jusqu'au premier chiffre impair inclus. La somme peut être constituée d'un seul chiffre.",
        "digits": "1425"
    },
    {
        "title": "Extra Region Skyscraper",
        "author": "MavericksJD",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nExtra Region: Dans les cellules ombrées en vert, chaque chiffre doit apparaître exactement une fois. \n\nGratte-ciels : les chiffres de la grille représentent les gratte-ciels, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts obscurcissent tous les gratte-ciels plus petits derrière eux. Les indices en dehors de la grille indiquent le nombre de gratte-ciels vus dans cette ligne/colonne, à partir de la ligne de vue de l'indice.",
        "digits": "2614"
    },
    {
        "title": "Matreshka Gusenitsa",
        "author": "Lucian",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes de poupées russes : les indices extérieurs indiquent qu'il y a deux chiffres qui s'additionnent à l'indice et que le ou les chiffres entre eux s'additionnent également à l'indice. Par exemple, un indice 5 pourrait être rempli, par exemple, par 1234 ou 154.",
        "digits": "6534"
    },
    {
        "title": "Stitched together",
        "author": "cornishjohn",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotements allemands : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.\n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.",
        "digits": "2641"
    },
    {
        "title": "Tetromino Thingy",
        "author": "Myxo",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nTétrominos à somme identique : divisez entièrement la grille en tétrominos (c'est-à-dire des zones connectées orthogonalement de taille 4). Deux tétrominos de la même forme ne peuvent pas se toucher orthogonalement, y compris les rotations et les réflexions. Certaines limites de tétromino ont déjà été données.\nLes chiffres ne peuvent pas se répéter dans un tétromino et les chiffres de chaque tétromino doivent totaliser le même total.\n\nPair : les cellules contenant un carré gris sont paires.",
        "digits": "3562"
    },
    {
        "title": "Counting Turns",
        "author": "jubale",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs.\n\nChemins Mintonette : tracez des chemins à travers les centres de certaines cellules, reliant chaque grand cercle exactement à un autre. Les chemins ne peuvent pas se croiser, se croiser eux-mêmes ou croiser les points Kropki. Les chiffres dans les cercles représentent le nombre de tours dans leur chemin connecté.",
        "digits": "2314"
    },
    {
        "title": "Parity Arrows",
        "author": "mnasti2",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches de parité : un chiffre dans un cercle est égal à la somme soit des chiffres pairs, soit des chiffres impairs sur la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "3645"
    },
    {
        "title": "Cater-cave Kropki Loop",
        "author": "yttrio",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nBoucle Kropki Cave : dessinez une boucle d'une seule cellule de large composée de cellules connectées orthogonalement. La boucle ne doit pas se toucher elle-même, même en diagonale.\n\nLes chiffres adjacents le long de la boucle doivent être consécutifs ou avoir un rapport de 2:1.\n\nLes chiffres dans les cercles sont sur la boucle et donnent le nombre total de cellules de la boucle (y compris elle-même) vues dans toutes les directions horizontales/verticales combinées. Les cellules sans boucle bloquent la vision.\n\nLes chiffres dans les carrés NE SONT PAS sur la boucle et donnent le nombre total de cellules NON-boucle (y compris elle-même) vues dans toutes les directions horizontales/verticales combinées. Les cellules en boucle bloquent la vision.",
        "digits": "6241"
    },
    {
        "title": "Killer Sudoku",
        "author": "Sotek",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter et s'additionnent à la valeur en haut à gauche.",
        "digits": "4325"
    },
    {
        "title": "Domino Effect",
        "author": "3good5you",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de somme Domino : divisez chaque ligne entièrement en paires de chiffres adjacents. Chaque paire a la même somme. Des lignes différentes peuvent avoir des sommes différentes. \n\nInégalité : le symbole d'inégalité pointe vers le chiffre le plus petit.",
        "digits": "6135"
    },
    {
        "title": "6x6 Full Rank X-Sums",
        "author": "jonn",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFull Rank : chaque ligne représente deux nombres à 6 chiffres, un nombre se lisant de gauche à droite et l'autre de droite à gauche, il en va de même pour chaque colonne (de haut en bas et de bas en haut), ce qui donne 24 nombres au total. Par exemple, si la ligne 6 était 123456, cela représenterait les nombres, lus de gauche à droite, cent vingt-trois mille quatre cent cinquante-six et, lus de droite à gauche, six cent cinquante-quatre mille trois cent vingt et un. Les indices en dehors de la grille indiquent le « rang » numérique du nombre à 6 chiffres dans cette ligne ou colonne à partir de cette direction, 1 étant le plus bas et 24 le plus élevé.\n\nSommes X : les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice.\n\nDualité Rang complet-Sommes X : les indices en dehors de la grille sont à la fois des indices de rang complet et des sommes x. Tous les indices respectent les deux règles spécifiées ci-dessus.",
        "digits": "4612"
    },
    {
        "title": "Corners and Kropki",
        "author": "KingOfArrows",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres sur la flèche attachée. \n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement indiqués.",
        "digits": "6351"
    },
    {
        "title": "Oh no, my circles!",
        "author": "dumediat",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches de coordonnées : les chiffres sur une flèche indiquent les coordonnées du chiffre qui est leur somme. Le numéro de ligne est écrit sur la queue de la flèche, et le numéro de colonne est écrit sur la pointe de la flèche. Par exemple, si une flèche ressemble à ceci : -1 4>, alors il doit y avoir un 5 (1+4) dans r1c4. \n\nChaque flèche doit correspondre à une coordonnée différente. \n\nLes chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles. \n",
        "digits": "1432"
    },
    {
        "title": "Wriggle Wroom",
        "author": "Chilly",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nMagic Labyrinth Sequence Snake : il y a un seul « serpent » non ramifié, large d'une cellule et connecté orthogonalement dans la grille. Le serpent ne peut pas se toucher orthogonalement ou en diagonale.\n\nLe serpent contient une séquence potentiellement répétitive de trois chiffres distincts, à déterminer par le solveur, appelée la séquence du labyrinthe magique (MLS). La tête du serpent est située sous sa queue. Le MLS doit apparaître dans l'ordre numérique croissant de la tête à la queue. Par exemple, si le MLS est {2, 4, 6}, le contenu ordonné du serpent pourrait être : (tête) 2 4 6 2 4 6 (queue).\n\nCependant, les chiffres non inclus dans le MLS peuvent apparaître n'importe où le long du serpent. La séquence ML n'a donc pas besoin de commencer ou de se terminer exactement à la tête ou à la queue. Par exemple, un autre serpent valide, utilisant le même MLS de {2, 4, 6}, pourrait être : (tête) 5 3 2 4 6 5 1 2 5 1 4 1 6 1 (queue).\n\nPoints non consécutifs : les chiffres dans les cellules séparées par des points rouges doivent être non consécutifs. De plus, le serpent doit visiter exactement une des cellules séparées par des points rouges.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre. De plus, le serpent visite exactement une cellule sur deux adjacentes le long de la ligne.",
        "digits": "6351"
    },
    {
        "title": "Even It Up",
        "author": "sujoyku",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nQuadruples : les chiffres dans les cercles doivent tous apparaître au moins une fois dans les cellules qui les touchent.\n\nCompte pair : les chiffres dans les cercles indiquent également le nombre de chiffres pairs que contiennent ces quatre cellules environnantes. \n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Si deux flèches sont attachées au même cercle, elles totalisent chacune indépendamment la valeur du cercle. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "5214"
    },
    {
        "title": "Multitasking",
        "author": "Cris Moore",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nX-Sums : les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice.\n\nSandwich Sums : les chiffres en dehors de la grille indiquent la somme des chiffres qui sont placés entre 1 et 6 dans cette ligne ou colonne.\n\nLittle Killer : les nombres en dehors de la grille sont la somme des chiffres pointés le long de la diagonale indiquée. Les chiffres peuvent se répéter le long de ces diagonales comme le permettent normalement les autres règles.\n\nX-sum, Sandwich, Little Killer Duality : les indices avec la valeur « a » en dehors de la grille sont égaux au même nombre entier. Les deux indices sont des sommes X et des sommes sandwich dans la ligne et de petits tueurs le long des deux diagonales indiquées.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement indiqués.",
        "digits": "4125"
    },
    {
        "title": "Sudokupillar",
        "author": "Jay Dyer",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement indiqués.\n\nLignes de somme de région : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non.",
        "digits": "1536"
    },
    {
        "title": "Parasite",
        "author": "AnalyticalNinja",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLigne Kropki : les chiffres adjacents le long de la ligne grise doivent être consécutifs ou avoir un rapport de 1:2.",
        "digits": "4352"
    },
    {
        "title": "Gravitational Lensing",
        "author": "heliopolix",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nTrous noirs : placez six trous noirs, un dans chaque ligne, colonne et case. Les chiffres ne peuvent pas se répéter sur les trous noirs. Pour les besoins des indices de cette grille, les trous noirs ont une valeur de zéro. \n\nTrous blancs (doubleurs) : placez six trous blancs, un dans chaque ligne, colonne et case. Les chiffres ne peuvent pas se répéter sur les trous blancs. Pour les besoins des indices de cette grille, les trous blancs doublent la valeur d'une cellule. \nLes trous blancs et les trous noirs ne partagent jamais la même cellule.\n\nCages tueuses : les chiffres dans les cages ne peuvent pas se répéter (bien que les valeurs le puissent). La somme des valeurs dans une cage correspond à l'indice en haut à gauche. Une cage tueuse doit contenir un nombre égal de trous noirs et blancs, mais ce nombre peut être nul.\n\nPetit tueur téléporté : l'indice à l'extérieur de la grille avec une flèche est un petit tueur téléporté. Il indique que la somme des chiffres le long d'un chemin en diagonale commençant dans la cellule pointée par la flèche est supérieure à zéro. Ce chemin ne se termine que lorsqu'il atteint un bord de la grille. Lorsque le chemin entre dans un trou noir il se téléporte vers la cellule du trou blanc avec le même chiffre en conservant la direction du parcours du chemin d'origine et en incluant la valeur des deux trous dans sa somme. Le chemin doit visiter le même nombre de trous noirs et blancs, mais ce nombre peut être nul. \n\nSandwichs de trous : les indices en dehors de la grille sans flèches donnent la somme des chiffres entre les trous noirs et blancs dans la ligne ou la colonne indiquée, sans compter les valeurs des trous noirs et blancs dans la somme.",
        "digits": "1526"
    },
    {
        "title": "Dutch Six",
        "author": "rad",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotements néerlandais : les chiffres adjacents le long des lignes orange doivent avoir une différence d'au moins 2.\n\nSommes XV : les chiffres séparés par un V doivent totaliser 5.",
        "digits": "4362"
    },
    {
        "title": "Outies",
        "author": "RainbowSprinklez",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages meurtrières : les chiffres dans les cages ne peuvent pas se répéter et totaliser la valeur du haut gauche.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement donnés.",
        "digits": "2156"
    },
    {
        "title": "Kvell",
        "author": "ZegreS",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nThermomètres : les chiffres doivent strictement augmenter le long du thermomètre à partir de l'extrémité du bulbe.",
        "digits": "4521"
    },
    {
        "title": "Sandwich",
        "author": "RockyRoer",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSandwich Sums : les chiffres en dehors de la grille indiquent la somme des chiffres placés entre 1 et 6 dans cette ligne ou colonne.",
        "digits": "2653"
    },
    {
        "title": "Choco Banana",
        "author": "Menderbug",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nChoco Banana : Ombrez certaines cellules de telle sorte que tous les groupes de cellules ombrées soient rectangulaires et que tous les groupes de cellules non ombrées ne soient pas rectangulaires. Les cellules adjacentes de la même couleur d'ombrage sont dans le même groupe. \n\nLes chiffres entourés indiquent la taille du groupe dans lequel elles se trouvent, qu'elles soient ombrées ou non. Un groupe peut avoir n'importe quel nombre de chiffres entourés.",
        "digits": "3624"
    },
    {
        "title": "Slow to the Rub",
        "author": "FuryfulFawful",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nThermomètres lents : les chiffres ne doivent pas diminuer le long du thermomètre à partir de l'extrémité du bulbe.",
        "digits": "1562"
    },
    {
        "title": "Primed for some math",
        "author": "Qinlux",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nTouching Primes : les 4 chiffres touchant orthogonalement une cellule contenant un cercle doivent totaliser un nombre premier. De même, les 4 chiffres touchant en diagonale une cellule contenant un cercle doivent totaliser un nombre premier. Les 2 nombres premiers autour d'un cercle n'ont pas nécessairement la même valeur.\n\nLes sommes n'incluent que les chiffres entièrement dans cette grille. Ainsi, pour le cercle de la ligne 2 de la colonne 6, il y a 2 cellules diagonales et 3 cellules orthogonales dont la somme est un nombre premier chacune.",
        "digits": "3451"
    },
    {
        "title": "caterdokupillar pozl",
        "author": "PulverizingPancake",
        "rules": "Les règles normales du sudoku 6x6 s'appliquent.\n\nLignes de fermeture éclair : les lignes lavande de la grille sont des lignes de fermeture éclair. Les chiffres équidistants du centre de la ligne doivent totaliser la même valeur. Si une ligne de fermeture éclair comporte un nombre impair de cellules, le chiffre de la cellule centrale définit cette somme. Les chiffres peuvent se répéter sur ces lignes si d'autres règles du sudoku le permettent. Par exemple, une ligne de fermeture éclair valide pourrait être 3146253 qui a une valeur de somme de 6.",
        "digits": "1526"
    },
    {
        "title": "Quiet neighbors",
        "author": "DreamLibrarian",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de chuchotement allemandes : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement donnés.",
        "digits": "4352"
    },
    {
        "title": "Caged Consecutives",
        "author": "Tulrak",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nCages meurtrières : les chiffres dans les cages ne peuvent pas se répéter.",
        "digits": "4651"
    },
    {
        "title": "XV-Inequality",
        "author": "CJK",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nInégalité : les symboles d'inégalité pointent vers le plus petit chiffre.\n\nSommes V : les chiffres séparés par un symbole V doivent totaliser 5.\n\nInégalité-V-Ambiguïté : tous les indices sont soit des symboles d'inégalité, soit des symboles V. Tous les symboles V sont orientés correctement, c'est-à-dire avec leur côté pointu vers le bas. ",
        "digits": "1563"
    },
    {
        "title": "Xternal Spikes",
        "author": "gdc",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nFlèches : la valeur dans un cercle est égale à la somme des valeurs sur la flèche attachée. Les valeurs en dehors de la grille sur les flèches peuvent dépasser 6.\n\nX-Sum : les valeurs placées en dehors de la grille sur les flèches deviennent un indice X-Sum. C'est-à-dire que la valeur en dehors de la grille doit être égale à la somme des X premiers chiffres, vus dans la direction de l'indice, où X est le premier chiffre de cette ligne ou colonne.",
        "digits": "5462"
    },
    {
        "title": "Entropic Whisperpillar",
        "author": "Nell Gwyn",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nEntropic Whispers : deux chiffres exactement à un ou deux pas d'intervalle le long de la ligne orange et jaune doivent différer d'au moins deux. \nEn d'autres termes, les chiffres adjacents doivent différer d'au moins deux et deux chiffres qui partagent le même chiffre adjacent doivent également différer d'au moins deux. ",
        "digits": "4316"
    },
    {
        "title": "XY Sandwiches",
        "author": "Scojo",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nXY Sandwiches : les indices en dehors de la grille donnent la somme des chiffres entre les Xème et Yème cellules de cette ligne ou colonne, où X et Y sont les deux premières cellules vues depuis la direction de l'indice. Par exemple, si les deux premiers chiffres de la ligne sont 2 et 5, alors les chiffres entre les 2e et 5e cellules (donc les 3e et 4e chiffres) une fois additionnés donneront la valeur indiquée.",
        "digits": "3521"
    },
    {
        "title": "Candypillar",
        "author": "Niverio",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nXV Sums : Les chiffres séparés par un V doivent totaliser 5, et les chiffres séparés par un X doivent totaliser 10.\n\nKropki Dots : Les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.\n\nXV-Kopki-Ambiguity : Il y a 3 points de couleurs différentes. Les 3 couleurs représentent 3 des 4 contraintes des indices Kropki blanc, Kropki noir, V et X (expliqués ci-dessus). Quelle couleur représente quelle contrainte doit être déduite par le solveur, y compris celle qui est laissée de côté.\n\nPalindromes : les chiffres sur une ligne grise se lisent de la même manière à l'endroit et à l'envers.",
        "digits": "6412"
    },
    {
        "title": "Odd-Even Portal Sudoku",
        "author": "Madmahogany",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPair/Impair : les cellules contenant un carré gris sont paires. Les cellules contenant un cercle gris sont impaires.\n\nCellules portail : les carrés rouges sont des cellules « portail ». Si une cellule rouge de la ligne R, colonne C a une valeur V, alors la cellule de la ligne V, colonne R a une valeur C, et la cellule de la ligne C, colonne V a une valeur R. Autrement dit, si nous représentons la cellule rouge comme (R,C,V), alors (V,R,C) et (C,V,R) sont également valables dans la grille de Sudoku. Par exemple, si la ligne 1 colonne 2 est 5, alors la ligne 5 colonne 1 est 2 et la ligne 2 colonne 5 est 1.",
        "digits": "5136"
    },
    {
        "title": "Group Sums Sudoku",
        "author": "Prasanna Seshadri",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nSommes de groupe : un nombre dans un cercle donne la somme des chiffres dans les cellules qui l'entourent. Ces chiffres peuvent se répéter si d'autres règles le permettent. ",
        "digits": "1352"
    },
    {
        "title": "The Whispering Nimmersatt",
        "author": "BugsCantHide",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes de murmures allemands : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.",
        "digits": "5643"
    },
    {
        "title": "Diagonal Skyscrapers",
        "author": "punchingcatto",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nGratte-ciels : les chiffres de la grille représentent les gratte-ciels, leurs valeurs correspondant à leurs hauteurs. Les gratte-ciels plus hauts obscurcissent tous les gratte-ciels plus petits derrière eux. Les indices en dehors de la grille indiquent le nombre de gratte-ciels vus dans la grille le long de la direction indiquée.",
        "digits": "3254"
    },
    {
        "title": "Indexer Sudoku",
        "author": "SSGranor",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nDouble indexeurs : le chiffre dans une cellule ombrée indique à la fois la colonne dans laquelle le numéro de colonne de la cellule apparaît dans sa ligne et la ligne dans laquelle son numéro de ligne apparaît dans sa colonne. (c'est-à-dire que si r4c6 était un 3, il y aurait un 6 dans r4c3 et un 4 dans r3c6.)",
        "digits": "4163"
    },
    {
        "title": "Caterdokupillar Renban",
        "author": "Lombax999",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre. ",
        "digits": "2516"
    },
    {
        "title": "34 Degree Caterdoku",
        "author": "Twototenth",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nIndexeurs de lignes : chaque chiffre des colonnes 3 et 4 indique la position du 3 et du 4 dans la même ligne (c'est-à-dire que si la ligne 1 colonne 3 est un 5, alors la ligne 1 colonne 5 est un 3). \n\nThermomètres : les chiffres doivent augmenter strictement le long du thermomètre à partir de l'extrémité du bulbe. ",
        "digits": "4351"
    },
    {
        "title": "M for Massive Clones",
        "author": "Botaku",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nClones : les cages contiennent exactement les mêmes chiffres dans les mêmes positions relatives. Les chiffres peuvent se répéter dans les cages comme le permettent normalement les autres règles.",
        "digits": "1624"
    },
    {
        "title": "Aileron",
        "author": "Teal",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes de somme des régions : les lignes bleues sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non.",
        "digits": "3415"
    },
    {
        "title": "Nabner kropki sudoku",
        "author": "arctan",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes Nabner : si un chiffre apparaît sur une ligne jaune, les chiffres qui lui sont consécutifs n'apparaissent pas sur la ligne. Les chiffres ne peuvent pas se répéter sur une ligne Nabner. Par exemple, si un 2 apparaît sur la ligne, alors 1 et 3 n'apparaissent pas sur la ligne, et un autre 2 n'apparaît pas non plus.\n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.",
        "digits": "1542"
    },
    {
        "title": "Find the Whispers",
        "author": "randall",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes X : les chiffres en dehors de la grille indiquent la somme des X premiers chiffres, où X est le chiffre dans la cellule la plus proche de l'indice. Avec ? représentant toute valeur X-Sum valide et >1 représentant toute valeur X-Sum supérieure à 1. Cette séquence des premières cellules X sera également une ligne German Whispers valide.\n\nLignes German Whispers : les chiffres adjacents le long d'une ligne German Whispers doivent avoir une différence d'au moins 3.",
        "digits": "1643"
    },
    {
        "title": "Crescent Moon",
        "author": "Walker",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée.",
        "digits": "6152"
    },
    {
        "title": "German Whispers",
        "author": "Yoshi Baroshi",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes de chuchotement allemandes : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3.",
        "digits": "2634"
    },
    {
        "title": "Sunday stroll",
        "author": "Jonesy",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nCages meurtrières : les chiffres dans les cages ne peuvent pas se répéter et s'additionner à la valeur en haut à gauche.\n\nChemin meurtrier : dessinez un chemin qui se déplace strictement orthogonalement, commence dans un cercle et se termine dans l'autre cercle. Le chemin peut se toucher orthogonalement ou en diagonale, mais ne peut pas se ramifier ou se croiser. Le chemin visite chaque case au moins une fois.\n\nTous les chiffres du chemin à l'intérieur d'une case s'additionneront à la même valeur que l'indice de la cage meurtrière pour cette case. Plusieurs visites comptent pour la même somme.\n\nLe chemin doit toujours traverser au moins une cellule de la cage du tueur mais ne peut jamais traverser toutes les cellules de la cage.\n\nLe chemin dans la case 5 n'est pas restreint par les règles ci-dessus. \n",
        "digits": "4152"
    },
    {
        "title": "Irregular Palindrome Kropki",
        "author": "Charlie Pugh",
        "rules": "Les règles normales du Sudoku irrégulier s'appliquent\n\nLes lignes grises sont des palindromes et contiennent les mêmes chiffres lorsqu'elles sont lues dans chaque direction\n\nLes chiffres séparés par un point blanc doivent être consécutifs\nLes chiffres séparés par un point noir doivent avoir un rapport de 2:1\nTous les chiffres possibles ne sont pas nécessairement donnés",
        "digits": "6423"
    },
    {
        "title": "Caterdokukropki",
        "author": "myShoggoth",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés. \n",
        "digits": "5634"
    },
    {
        "title": "Simon Says",
        "author": "Derektionary",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nFlèches à regarder et à dire : le chiffre sur la pointe de la flèche indique combien de fois le chiffre dans le cercle de la flèche apparaît le long de l'ensemble de cellules diagonales vers lesquelles pointe la flèche.",
        "digits": "4251"
    },
    {
        "title": "Fingers",
        "author": "Rubenscube",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement donnés.",
        "digits": "3516"
    },
    {
        "title": "Triangulation",
        "author": "damasosos92",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes de somme de région : ces lignes sont divisées en segments par des bordures de boîte. Dans chaque ligne individuelle, la somme des chiffres de chaque segment est la même. La somme des segments sur différentes lignes peut être égale ou non. \n\nLignes modulaires : le long de ces lignes, trois chiffres adjacents le long d'une ligne modulaire ont un reste distinct lors de la division par 3. Les chiffres qui partagent un reste sont (1, 4) ; (2, 5) ; (3, 6). Les chiffres peuvent se répéter sur ces lignes si d'autres règles le permettent.\n\nDualité Région-Somme-Lignes-Modulaire : les lignes grises sont à la fois des lignes de somme de région et des lignes modulaires. Elles adhèrent aux propriétés ci-dessus. Une ligne dans une seule case n'a aucune incidence sur les règles de somme des lignes de région.",
        "digits": "5142"
    },
    {
        "title": "Bait",
        "author": "zetamath",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.\n\nPoints Kropki : les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.",
        "digits": "6534"
    },
    {
        "title": "Memristor's disappointment ",
        "author": "Donatello_86 ",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages meurtrières : les chiffres dans les cages totalisent la valeur en haut à gauche.\n\nLignes German Whispers : les chiffres adjacents le long des lignes vertes doivent avoir une différence d'au moins 3. ",
        "digits": "4612"
    },
    {
        "title": "Productive",
        "author": "Oddlyeven",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nLignes produit-somme : les chiffres le long d'une ligne s'additionnent au produit des chiffres dans les cases à chaque extrémité de la ligne. Les chiffres peuvent se répéter sur une ligne comme le permettent normalement les autres règles.",
        "digits": "3465"
    },
    {
        "title": "German Snake",
        "author": "Oripy",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSerpent allemand : ombrez certaines cellules pour former un chemin sans intersection qui ne se touche pas orthogonalement ou en diagonale. Les cercles noirs indiquent le début et la fin du chemin. Tandis que les cercles blancs indiquent que la cellule fait partie du chemin.\nLe serpent forme une ligne de murmures allemands. Les chiffres adjacents le long de la ligne doivent avoir une différence d'au moins 3.",
        "digits": "5341"
    },
    {
        "title": "Parity Party",
        "author": "Lulero",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nPair/Impair : les cellules contenant un carré gris sont paires. Les cellules contenant un cercle gris sont impaires.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement donnés.",
        "digits": "6153"
    },
    {
        "title": "higher-lower",
        "author": "paletron",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes supérieures-inférieures : le long des lignes roses, chaque chiffre doit être strictement supérieur ou strictement inférieur à tous les chiffres adjacents le long de la ligne. Autrement dit, la ligne se compose d'un motif alterné de chiffre supérieur, chiffre inférieur, chiffre supérieur, chiffre inférieur, et ainsi de suite.",
        "digits": "2541"
    },
    {
        "title": "Renbank",
        "author": "Dennis Chen",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLignes Renban : les chiffres sur une ligne violette forment un ensemble de chiffres consécutifs non répétitifs dans n'importe quel ordre.",
        "digits": "1653"
    },
    {
        "title": "Box Sum Killer",
        "author": "Scruffamudda",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSommes de boîtes uniques : les chiffres dans les cages s'additionnent aux totaux des cages qui doivent être déterminés par le solveur. Les cages dans la même boîte ont le même total. Les cages dans des boîtes différentes ont des totaux différents. \n",
        "digits": "4521"
    },
    {
        "title": "Stepping Stones",
        "author": "Meggen033",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKropki Dots : les chiffres séparés par un point blanc sont consécutifs. Les chiffres séparés par un point noir ont un rapport de 1:2. Tous les points ne sont pas nécessairement donnés.\n\nKiller Cages : la somme des chiffres dans les cages correspond à la valeur en haut à gauche.",
        "digits": "6312"
    },
    {
        "title": "Invisible Sums",
        "author": "KenGlue",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSum Some Arrows : la somme de tous les chiffres derrière la queue de la flèche est égale à la somme des N premiers chiffres pointés par la pointe de la flèche, où N doit être déterminé par le solveur et peut être différent pour chaque flèche. \n",
        "digits": "3541"
    },
    {
        "title": "Arrow Sudoku",
        "author": "Nityant Agarwal",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nFlèches : un chiffre dans un cercle est égal à la somme des chiffres de la flèche attachée. Les chiffres peuvent se répéter le long des flèches comme le permettent normalement les autres règles.",
        "digits": "3412"
    },
    {
        "title": "Health Bar",
        "author": "Black_Doom",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\n​​Points de vie : les indices situés en dehors de la grille donnent la somme des chiffres qui sont égaux à leur distance par rapport à l'indice. Par exemple, une ligne de 152436 aurait un indice 11 à gauche, puisque 1, 4 et 6 correspondent à leurs positions, et un indice 5 à droite, puisque seul le 5 correspond à sa position dans cette direction.",
        "digits": "1534"
    },
    {
        "title": "Pay Attention, residue class!",
        "author": "Dr Logic",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nCages Mod 3 : L'indice dans une cage est la somme des chiffres de cette cage modulo 3. En d'autres termes, si vous divisez la somme des chiffres d'une cage par 3, le reste sera égal à l'indice de la cage.\n\nLignes modulaires : Trois chiffres adjacents le long d'une ligne turquoise ont un reste distinct lors de la division par 3. Les chiffres qui partagent un reste sont (1, 4) ; (2, 5) ; (3, 6). Les chiffres peuvent se répéter sur ces lignes si d'autres règles le permettent.\n\nPoints Kropki : les chiffres séparés par un point blanc sont consécutifs. Tous les points ne sont pas nécessairement indiqués.\n\n\n\n",
        "digits": "2351"
    },
    {
        "title": "Caterpillarsandthermowich",
        "author": "PrimeWeasel",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nSandwich Sums : les indices en dehors de la grille indiquent la somme des chiffres qui sont placés entre 1 et 6 dans cette ligne ou colonne. Un « ?» peut remplacer n'importe quelle valeur de 0 à 9, mais aucun indice ne peut avoir de zéro initial.\n\nThermometer Sandwiches : de plus, dans les lignes/colonnes avec des indices Sandwich, les chiffres 1 et 6 et les chiffres qui sont placés entre eux doivent tous être dans l'ordre croissant lorsqu'ils sont vus à partir de l'indice Sandwich. \n",
        "digits": "3465"
    },
    {
        "title": "Killer Dominos",
        "author": "Tahg",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages totalisent la valeur en haut à gauche si elle est donnée.\n\nDominos : aucune cage ne contient le même ensemble de chiffres.",
        "digits": "4152"
    },
    {
        "title": "Walkies",
        "author": "Lola",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nLola adore se promener, mais où est-elle allée ? Tracez une ligne non croisée dans la grille reliant les centres des cellules adjacentes pour former une boucle qui visite chaque région exactement une fois. La ligne peut se déplacer en diagonale et doit passer par chaque ensemble de traces de pattes. Les chiffres adjacents sur la ligne doivent avoir une différence d'au plus 1.",
        "digits": "2634"
    },
    {
        "title": "Battenburger",
        "author": "Cura",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent.\n\nKiller Cages : les chiffres dans les cages ne peuvent pas se répéter et s'additionner à la valeur en haut à gauche.\n\nBattenburg : autour des symboles Battenburg (carrés à carreaux gris dans les coins), une paire de chiffres en diagonale doit être paire, l'autre doit être impaire.\nTous les Battenburg ne sont pas nécessairement donnés.",
        "digits": "4351"
    },
    {
        "title": "The Rear End",
        "author": "Panthera",
        "rules": "Les règles normales du Sudoku 6x6 s'appliquent. \n\nSommes japonaises : les carrés à l'extérieur de la grille indiquent l'ordre des séries de cellules contiguës qui doivent être ombrées de la couleur de l'indice. Le nombre dans le carré indique la somme des cellules de la série. Toutes les séries ombrées sont indiquées.\n\nLes couleurs utilisées dans ce puzzle sont le vert, le rouge et le jaune. Pour de meilleurs résultats, supprimez toutes les marques non ombrées que vous avez faites une fois terminé."
    }
]